app/controllers/authorizations_controller.rb

SELECT "authorizations".id FROM "authorizations" WHERE ("authorizations"."uid" = '27832673' AND "authorizations".provider = 'twitter') LIMIT 1
INSERT INTO "authorizations" ("created_at", "updated_at", "uid", "user_id", "provider") VALUES('2010-11-16 14:53:25', '2010-11-16 14:53:25', '27832673', 2, 'twitter')
INSERT INTO "users" ("created_at", "crypted_password", "perishable_token", "updated_at", "username", "password_salt", "persistence_token", "email") VALUES('2010-11-16 14:53:24', NULL, '2nUAVZ3TaIQNJKjiOtKZ', '2010-11-16 14:53:24', 'Madhusudhan ^MS', NULL, NULL, NULL)
---
  def create
    omniauth = request.env['omniauth.auth'] #this is where you get all the data from your provider through omniauth
    @auth = Authorization.find_from_hash(omniauth)
    if current_user
      flash[:notice] = "Successfully added #{omniauth['provider']} authentication"
      current_user.authorizations.create(:provider => omniauth['provider'], :uid => omniauth['uid']) #Add an auth to existing user

SELECT * FROM "authorizations" WHERE ("authorizations"."id" = 1 AND ("authorizations".user_id = 2))
DELETE FROM "authorizations" WHERE "id" = 1
---
  def destroy
    @authorization = current_user.authorizations.find(params[:id])
    flash[:notice] = "Successfully deleted #{@authorization.provider} authentication."
    @authorization.destroy