app/controllers/statuses_controller.rb

INSERT INTO "statuses" ("created_at", "updated_at", "user_id", "message") VALUES('2010-11-16 15:26:32', '2010-11-16 15:26:32', NULL, 'a d asdsadd')
---
  def create
    @status = Status.new(params[:status])
    @status.user_id = current_user.id
    if @status.save

SELECT * FROM "statuses"
---
  def index
    @statuses = Status.all :order => 'created_at desc'