app/controllers/users_controller.rb

  def create
    @user = User.new(params[:user])
    if @user.save
---
INSERT INTO "users" ("created_at", "crypted_password", "perishable_token", "updated_at", "username", "password_salt", "persistence_token", "email") VALUES('2010-11-16 13:18:06', 'b1380a3741385a6844ce1dd64b3298189d82e9daf2455a7d93c3a29124432b19ff729876140f8e2f831e271ab03189ab37eaaaad225ae9b08573c17ded9c26bb', 'LURIMb4VOoC6V8qATuxv', '2010-11-16 13:18:06', 'madhums', 'yKQaF2vO9ssfFw0U5haI', '5d205fb6849531b6c0da11b11e51382c356bcc057d8ecbdeb2210ec452898e3888bc9a9186a37c17a2bab45eba38657c2e6dbcfcc4b084775f99727ba2758dfb', 'madhums8@gmail.com')

  def update
    if @user.update_attributes(params[:user])
---
UPDATE "users" SET "updated_at" = '2010-11-16 13:18:12', "perishable_token" = 'GAq2gjQgP84vo1OklLp' WHERE "id" = 1

  def find_user
    @user = User.find(params[:id])
---
SELECT * FROM "users" WHERE ("users"."id" = '2') LIMIT 1